---
kind: type
id: T:Autodesk.Revit.DB.LinkVisibility
source: html/f33e82f3-5bec-4532-457e-d01dc537024f.htm
---
# Autodesk.Revit.DB.LinkVisibility

Link visibility types.

## Syntax (C#)
```csharp
public enum LinkVisibility
```